Autodesk.Revit.DB.FamilySizeTable.AsValueString(System.Int32,System.Int32)
Gets the table cell value as a string.
row:
The table row.
column:
The table column.
Returns:
The table cell value as a string.
Since:
2014

Autodesk.Revit.DB.FamilySizeTable.IsValidColumnIndex(System.Int32)
Checks if the column index is valid.
index:
The index of the column.
Returns:
True if the column index is valid, false otherwise.
Since:
2014

Autodesk.Revit.DB.FamilySizeTable.GetColumnHeader(System.Int32)
Gets a column of the table at at given index.
index:
Index of the column.
Returns:
The column at the given index.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The column index is out of range.
Since:
2014

Autodesk.Revit.DB.FamilySizeTable.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FamilySizeTable.NumberOfColumns
Number of columns in the table.
Since:
2014

Autodesk.Revit.DB.FamilySizeTable.NumberOfRows
Number of rows in the table.
Since:
2014

Autodesk.Revit.DB.FamilySizeTable
Contains size information for a family.
Since:
2014